simondlevy/Hackflight/src/escs/dshot/stm32f405.h
/*
   Copyright (c) 2022 Simon D. Levy

   This file is part of Hackflight.

   Hackflight is free software: you can redistribute it and/or modify it under the
   terms of the GNU General Public License as published by the Free Software
   Foundation, either version 3 of the License, or (at your option) any later
   version.

   Hackflight is distributed in the hope that it will be useful, but WITHOUT ANY
   WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A
   PARTICULAR PURPOSE. See the GNU General Public License for more details.

   You should have received a copy of the GNU General Public License along with
   Hackflight. If not, see <https://www.gnu.org/licenses/>.
 */ 

#pragma once

#include <string.h>

#include "escs/dshot.h"

#include "stm32f4xx.h"
#include "dma.h"

__attribute__( ( always_inline ) ) static inline void __set_BASEPRI_nb(uint32_t basePri)
{
    __ASM volatile ("\tMSR basepri, %0\n" : : "r" (basePri) );
}

static inline void __basepriRestoreMem(uint8_t *val)
{
    __set_BASEPRI(*val);
}

static inline uint8_t __basepriSetMemRetVal(uint8_t prio)
{
    __set_BASEPRI_MAX(prio);
    return 1;
}

#define ATOMIC_BLOCK(prio) \
    for ( uint8_t __basepri_save __attribute__ \
            ((__cleanup__ (__basepriRestoreMem), __unused__)) = __get_BASEPRI(), \
            __ToDo = __basepriSetMemRetVal(prio); __ToDo ; __ToDo = 0 )


class Stm32F405DshotEsc : public DshotEsc {

    private:

        // Constants ====================================================================

        static const uint32_t RCC_AHB1ENR_GPIOAEN_MSK = 0x00000001;
        static const uint32_t RCC_AHB1ENR_GPIOBEN_MSK = 0x00000002;
        static const uint32_t RCC_AHB1ENR_GPIOCEN_MSK = 0x00000004;
        static const uint32_t RCC_AHB1ENR_GPIODEN_MSK = 0x00000008;
        static const uint32_t RCC_AHB1ENR_GPIOEEN_MSK = 0x00000010;
        static const uint32_t RCC_AHB1ENR_GPIOFEN_MSK = 0x00000020;

        static const uint8_t GPIO_FAST_SPEED = 0x02;
        static const uint8_t GPIO_MODE_OUT   = 0x01;
        static const uint8_t GPIO_PUPD_UP    = 0x01;
        static const uint8_t GPIO_OTYPE_PP   = 0x00;

        static const uint32_t RCC_AHB1PERIPH_DMA2 = 0x00400000;

        static const uint8_t DMA_TIMER_MAPPING_COUNT = 6;

        static const uint32_t NVIC_PRIORITY_GROUPING = 0x500;

        static const uint8_t DEFIO_PORT_USED_COUNT = 6;

        static const uint8_t HARDWARE_TIMER_DEFINITION_COUNT = 14;

        static const uint8_t MAX_TIMER_DMA_OPTIONS = 3;

        static const uint32_t TRANSFER_IT_ENABLE_MASK = 
            (uint32_t)(DMA_SxCR_TCIE | DMA_SxCR_HTIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE);

        static const uint32_t DMA_IT_TCIF  = 0x00000020;
        static const uint32_t DMA_IT_TEIF  = 0x00000008;

        static const uint8_t MAX_MOTORS = 4;
        static const uint8_t STATE_PER_SYMBOL = 3;
        static const uint8_t FRAME_BITS = 16;
        static const uint8_t BUF_LENGTH = FRAME_BITS * STATE_PER_SYMBOL;

        const uint32_t MOTOR_PINS[4]  = {0, 1, 3, 2};
        const uint32_t MOTOR_PORTS[4] = {1, 1, 0, 0};

        // Typedefs =====================================================================

        typedef enum { 
            GPIO_Mode_IN, 
            GPIO_Mode_OUT, 
            GPIO_Mode_AF, 
            GPIO_Mode_AN
        } GPIOMode_TypeDef;

        enum rcc_reg {
            RCC_EMPTY,
            RCC_AHB,
            RCC_APB2,
            RCC_APB1,
            RCC_AHB1,
        };

        typedef void * IO_t; 

        typedef struct {
            TIM_TypeDef *TIMx;
            uint8_t rcc;
        } timerDef_t;

        struct dmaChannelDescriptor_s;

        typedef void (*dmaCallbackHandlerFuncPtr)(
                struct dmaChannelDescriptor_s *channelDescriptor);

        typedef struct dmaChannelDescriptor_s {
            DMA_TypeDef*                dma;
            dmaResource_t               *ref;
            uint8_t                     stream;
            uint32_t                    channel;
            dmaCallbackHandlerFuncPtr   irqHandlerCallback;
            uint8_t                     flagsShift;
            IRQn_Type                   irqN;
            uint32_t                    userParam;
            uint8_t                     resourceIndex;
        } dmaChannelDescriptor_t;

        // Per pacer timer
        typedef struct bbPacer_s {
            TIM_TypeDef *tim;
            uint16_t dmaSources;
        } bbPacer_t;

        typedef struct dmaRegCache_s {
            uint32_t CR;
            uint32_t FCR;
            uint32_t NDTR;
            uint32_t PAR;
            uint32_t M0AR;
        } dmaRegCache_t;

        // Per GPIO port and timer channel
        typedef struct {

            int32_t portIndex;

            GPIO_TypeDef *gpio;

            uint8_t channel;

            uint16_t dmaSource;

            dmaResource_t *dmaResource; // DMA resource for this port & timer channel
            uint32_t dmaChannel;        // DMA channel or peripheral request

            // DMA resource register cache
            dmaRegCache_t dmaRegOutput;
            dmaRegCache_t dmaRegInput;

            // For direct manipulation of GPIO_MODER register
            uint32_t gpioModeMask;
            uint32_t gpioModeInput;
            uint32_t gpioModeOutput;

            // Idle value
            uint32_t gpioIdleBSRR;

            // Output
            uint16_t outputARR;
            uint32_t *portOutputBuffer;
            uint32_t portOutputCount;

            // TIM initialization
            uint16_t TIM_Prescaler;       
            uint16_t TIM_CounterMode;       
            uint32_t TIM_Period;            
            uint16_t TIM_ClockDivision;     
            uint8_t  TIM_RepetitionCounter;  

        } port_t;

        typedef struct {
            uint16_t        code;
            dmaResource_t * ref;
            uint32_t        channel;
        } dmaChannelSpec_t;

        typedef struct {
            TIM_TypeDef *tim;
            uint8_t channel;
            dmaChannelSpec_t channelSpec[MAX_TIMER_DMA_OPTIONS];
        } dmaTimerMapping_t;

        typedef struct bbMotor_s {
            uint16_t value;
            int32_t pinIndex;    
            int32_t portIndex;
            IO_t io;        
            uint8_t output;
            uint32_t iocfg;
            port_t *bbPort;
            bool configured;
            bool enabled;
        } motor_t;

