simondlevy/Hackflight/src/escs/dshot/stm32f405.h
        typedef struct {
            GPIO_TypeDef *gpio;
            uint16_t pin;
            uint8_t index;
        } ioRec_t;

        // Static local funs ============================================================

        static uint8_t io_config(
                const uint8_t mode,
                const uint8_t speed,
                const uint8_t otype,
                const uint8_t pupd) 
        {
            return mode | (speed << 2) | (otype << 4) | (pupd << 5);
        }


        static uint32_t log2_8bit(uint32_t v)  
        {
            return 8 - 90/((v/4+14)|1) - 2/(v/2+1);
        }

        static uint32_t log2_16bit(uint32_t v) 
        {
            return 8*(v>255) + log2_8bit(v >>8*(v>255));
        }

        static uint32_t log2_32bit(uint32_t v) 
        {
            return 16*(v>65535L) + log2_16bit(v*1L >>16*(v>65535L));
        }


        static uint32_t rcc_encode(uint32_t reg, uint32_t mask) 
        {
            return (reg << 5) | log2_32bit(mask);
        }

        static uint32_t nvic_build_priority(uint32_t base, uint32_t sub) 
        {
            return (((((base)<<(4-(7-(NVIC_PRIORITY_GROUPING>>8))))|
                            ((sub)&(0x0f>>(7-(NVIC_PRIORITY_GROUPING>>8)))))<<4)&0xf0);
        }

        static uint32_t nvic_priority_base(uint32_t prio) 
        {
            return (((prio)>>(4-(7-(NVIC_PRIORITY_GROUPING>>8))))>>4);
        }

        static uint32_t nvic_priority_sub(uint32_t prio) 
        {
            return (((prio)&(0x0f>>(7-(NVIC_PRIORITY_GROUPING>>8))))>>4);
        }

        static void RCC_APB2PeriphClockEnable(uint32_t RCC_APB2Periph)
        {
            RCC->APB2ENR |= RCC_APB2Periph;
        }

        static void RCC_AHB1PeriphClockEnable(uint32_t RCC_AHB1Periph)
        {
            RCC->AHB1ENR |= RCC_AHB1Periph;
        }

        static void RCC_APB1PeriphClockEnable(uint32_t RCC_APB1Periph)
        {
            RCC->APB1ENR |= RCC_APB1Periph;
        }

        static void RCC_ClockEnable(uint8_t periphTag)
        {
            int tag = periphTag >> 5;
            uint32_t mask = 1 << (periphTag & 0x1f);

            switch (tag) {
                case RCC_APB2:
                    RCC_APB2PeriphClockEnable(mask);
                    break;
                case RCC_APB1:
                    RCC_APB1PeriphClockEnable(mask);
                    break;
                case RCC_AHB1:
                    RCC_AHB1PeriphClockEnable(mask);
                    break;
            }
        }

        static void loadDmaRegs(dmaResource_t *dmaResource, dmaRegCache_t *dmaRegCache)
        {
            ((DMA_Stream_TypeDef *)dmaResource)->CR = dmaRegCache->CR;
        }

        static void saveDmaRegs(dmaResource_t *dmaResource, dmaRegCache_t *dmaRegCache)
        {
            dmaRegCache->CR = ((DMA_Stream_TypeDef *)dmaResource)->CR;
        }

        static uint32_t getDmaFlagStatus(
                dmaChannelDescriptor_t * descriptor, uint32_t flag) 
        {
            return descriptor->flagsShift > 31 ?
                descriptor->dma->HISR & (flag << (descriptor->flagsShift - 32)) :
                descriptor->dma->LISR & (flag << descriptor->flagsShift);
        }

        static void clearDmaFlag(
                dmaChannelDescriptor_t * descriptor, uint32_t flag) 
        {
            if (descriptor->flagsShift > 31) {
                descriptor->dma->HIFCR = (flag << (descriptor->flagsShift - 32)); 
            }
            else {
                descriptor->dma->LIFCR = (flag << descriptor->flagsShift);
            }
        }

        static void dmaCmd(port_t *bbPort, FunctionalState newState)
        {
            DMA_Stream_TypeDef * DMAy_Streamx = (DMA_Stream_TypeDef *)bbPort->dmaResource;

            if (newState != DISABLE) {
                DMAy_Streamx->CR |= (uint32_t)DMA_SxCR_EN;
            }
            else {
                DMAy_Streamx->CR &= ~(uint32_t)DMA_SxCR_EN;
            }
        }

        static void dmaIrqHandler(dmaChannelDescriptor_t *descriptor)
        {
            port_t *bbPort = (port_t *)descriptor->userParam;

            dmaCmd(bbPort, DISABLE);

            timDmaCmd(bbPort->dmaSource, DISABLE);

            if (getDmaFlagStatus(descriptor, DMA_IT_TEIF)) {
                while (1) {};
            }

            clearDmaFlag(descriptor, DMA_IT_TCIF);
        }

        static void dmaItConfig(port_t *bbPort)
        {
            DMA_Stream_TypeDef * DMAy_Streamx =
                (DMA_Stream_TypeDef *)bbPort->dmaResource;

            // Check if the DMA_IT parameter contains a FIFO interrupt 
            if ((DMA_IT_TC & DMA_IT_FE) != 0)
            {
                // Enable the selected DMA FIFO interrupts 
                DMAy_Streamx->FCR |= (uint32_t)DMA_IT_FE;
            }

            // Check if the DMA_IT parameter contains a Transfer interrupt 
            if (DMA_IT_TC != DMA_IT_FE) {
                // Enable the selected DMA transfer interrupts 
                DMAy_Streamx->CR |= (uint32_t)(DMA_IT_TC  & TRANSFER_IT_ENABLE_MASK);
            }
        }

        static void dmaPreconfigure(port_t *bbPort)
        {
            DMA_Stream_TypeDef * DMAy_Streamx = (DMA_Stream_TypeDef *)bbPort->dmaResource;

            DMAy_Streamx->CR = 0x0c025450;

            DMAy_Streamx->FCR =
                ((DMAy_Streamx->FCR & (uint32_t)~(DMA_SxFCR_DMDIS | DMA_SxFCR_FTH)) |
                 (DMA_FIFOMODE_ENABLE | DMA_FIFO_THRESHOLD_1QUARTERFULL));
            DMAy_Streamx->NDTR = bbPort->portOutputCount;
            DMAy_Streamx->PAR = (uint32_t)&bbPort->gpio->BSRR;
            DMAy_Streamx->M0AR = (uint32_t)bbPort->portOutputBuffer;

            saveDmaRegs(bbPort->dmaResource, &bbPort->dmaRegOutput);
        }

        static void timDmaCmd(uint16_t TIM_DMASource, FunctionalState newState)
        {
            if (newState != DISABLE) {
                // Enable the DMA sources
                TIM1->DIER |= TIM_DMASource; 
            }
            else {
                // Disable the DMA sources
                TIM1->DIER &= (uint16_t)~TIM_DMASource;
            }
        }

        static void outputDataInit(uint32_t *buffer, uint16_t portMask)
        {
            uint32_t resetMask = (portMask << 16);
            uint32_t setMask = portMask;

            for (auto bitpos=0; bitpos<16; bitpos++) {
                buffer[bitpos * 3 + 0] |= setMask ; // Always set all ports
                buffer[bitpos * 3 + 1] = 0;          // Reset bits are port dependent
                buffer[bitpos * 3 + 2] |= resetMask; // Always reset all ports
            }
        }

