simondlevy/Hackflight/src/escs/dshot/stm32f405.h
        static void outputDataSet(uint32_t *buffer, int32_t pinNumber, uint16_t value)
        {
            uint32_t middleBit = (1 << (pinNumber + 16));

            for (auto pos=0; pos<16; pos++) {
                if (!(value & 0x8000)) {
                    buffer[pos * 3 + 1] |= middleBit;
                }
                value <<= 1;
            }
        }

        static void outputDataClear(uint32_t *buffer)
        {
            // Middle position to no change
            for (auto bitpos=0; bitpos<16; bitpos++) {
                buffer[bitpos * 3 + 1] = 0;
            }
        }

        static void timebaseSetup(port_t *bbPort, protocol_t dshotProtocolType)
        {
            uint32_t outputFreq = 1000 * getDshotBaseFrequency(dshotProtocolType);
            bbPort->outputARR = SystemCoreClock / outputFreq - 1;
        }

        static uint16_t timerDmaSource(uint8_t channel)
        {
            switch (channel) {
                case TIM_CHANNEL_1:
                    return TIM_DMA_CC1;
                case TIM_CHANNEL_2:
                    return TIM_DMA_CC2;
                case TIM_CHANNEL_3:
                    return TIM_DMA_CC3;
                case TIM_CHANNEL_4:
                    return TIM_DMA_CC4;
            }
            return 0;
        }

        static ioRec_t* _IORec(IO_t io)
        {
            return (ioRec_t *)io;
        }

        static GPIO_TypeDef* _IO_GPIO(IO_t io)
        {
            const ioRec_t *ioRec =_IORec(io);
            return ioRec->gpio;
        }

        static uint16_t _IO_Pin(IO_t io)
        {
            const ioRec_t *ioRec =_IORec(io);
            return ioRec->pin;
        }

        static void _IOInit(IO_t io, uint8_t index)
        {
            ioRec_t *ioRec =_IORec(io);
            ioRec->index = index;
        }

        static uint8_t rcc_ahb1(uint32_t gpio)
        {
            return (uint8_t)rcc_encode(RCC_AHB1, gpio); 
        }

        static void GPIO_Init(
                GPIO_TypeDef* GPIOx,
                uint32_t pin,
                uint32_t mode,
                uint32_t speed,
                uint32_t pull
                )
        {
            uint32_t pinpos = 0x00, pos = 0x00 , currentpin = 0x00;

            for (pinpos = 0x00; pinpos < 0x10; pinpos++)
            {
                pos = ((uint32_t)0x01) << pinpos;

                currentpin = pin & pos;

                if (currentpin == pos)
                {
                    GPIOx->MODER  &= ~(GPIO_MODER_MODER0 << (pinpos * 2));
                    GPIOx->MODER |= (mode << (pinpos * 2));

                    if ((mode == GPIO_Mode_OUT) || (mode == GPIO_Mode_AF)) {

                        GPIOx->OSPEEDR &= ~(GPIO_OSPEEDER_OSPEEDR0 << (pinpos * 2));
                        GPIOx->OSPEEDR |= (speed << (pinpos * 2));

                        GPIOx->OTYPER  &= ~((GPIO_OTYPER_OT_0) << ((uint16_t)pinpos)) ;
                    }

                    GPIOx->PUPDR &= ~(GPIO_PUPDR_PUPDR0 << ((uint16_t)pinpos * 2));
                    GPIOx->PUPDR |= (pull << (pinpos * 2)); 
                }
            }
        }

        void _IOConfigGPIO(uint8_t motorIndex, IO_t io, uint8_t cfg)
        {
            const uint8_t ioPortDefs[6] = {
                { rcc_ahb1(RCC_AHB1ENR_GPIOAEN_MSK) },
                { rcc_ahb1(RCC_AHB1ENR_GPIOBEN_MSK) },
                { rcc_ahb1(RCC_AHB1ENR_GPIOCEN_MSK) },
                { rcc_ahb1(RCC_AHB1ENR_GPIODEN_MSK) },
                { rcc_ahb1(RCC_AHB1ENR_GPIOEEN_MSK) },
                { rcc_ahb1(RCC_AHB1ENR_GPIOFEN_MSK) },
            };

            uint8_t portIndex = MOTOR_PORTS[motorIndex];

            const uint8_t rcc = ioPortDefs[portIndex];

            RCC_ClockEnable(rcc);

            uint32_t pin =_IO_Pin(io);
            uint32_t mode  = (cfg >> 0) & 0x03;
            uint32_t speed = (cfg >> 2) & 0x03;
            uint32_t pull  = (cfg >> 5) & 0x03;

            GPIO_Init(_IO_GPIO(io), pin, mode, speed, pull);
        }

        // Instance variables ===========================================================

        uint8_t m_ioDefUsedOffset[DEFIO_PORT_USED_COUNT] = { 0, 16, 32, 48, 64, 80 };

        bbPacer_t m_pacers[MAX_MOTORS];  // TIM1 or TIM8

        port_t m_ports[MAX_MOTORS];

        int32_t m_usedMotorPorts;

        motor_t m_motors[MAX_SUPPORTED_MOTORS];

        uint32_t m_outputBuffer[BUF_LENGTH * MAX_MOTORS];

        uint8_t m_puPdMode;

        dmaChannelDescriptor_t m_dmaDescriptors[DMA_LAST_HANDLER];

        dmaTimerMapping_t m_dmaTimerMapping[DMA_TIMER_MAPPING_COUNT] = {};

        timerDef_t m_timerDefinitions[HARDWARE_TIMER_DEFINITION_COUNT] = {};

        uint8_t m_timer1channels[4] = {};

        static constexpr DMA_Stream_TypeDef * m_streams[8] = {
            DMA2_Stream0,
            DMA2_Stream1,
            DMA2_Stream2,
            DMA2_Stream3,
            DMA2_Stream4,
            DMA2_Stream5,
            DMA2_Stream6,
            DMA2_Stream7
        };

        ioRec_t m_ioRecs[96];

        // Private instance methods =====================================================

        IO_t _IOGetByTag(uint8_t tag)
        {
            const int32_t portIdx = (tag >> 4) - 1;
            const int32_t pinIdx = tag & 0x0F;

            if (portIdx < 0 || portIdx >= DEFIO_PORT_USED_COUNT) {
                return NULL;
            }

            // check if pin exists
            if (!(0xffff & (1 << pinIdx))) {
                return NULL;
            }

            // count bits before this pin on single port
            int32_t offset = __builtin_popcount(((1 << pinIdx) - 1) & 0xffff);

            // and add port offset
            offset += m_ioDefUsedOffset[portIdx];
            return m_ioRecs + offset;
        }

        static void timOcInit(
                volatile uint32_t * ccmr,
                volatile uint32_t * ccr,
                const uint32_t ccer_cc_e,
                const uint32_t ccmr_oc,
                const uint32_t ccmr_cc,
                const uint32_t ccer_ccp,
                const uint32_t ccer_ccnp,
                const uint32_t cr2_ois,
                const uint8_t mode_shift,
                const uint8_t polarity_shift1,
                const uint8_t state_shift,
                const uint8_t polarity_shift2
                )
        {
            TIM1->CCER &= (uint16_t)~ccer_cc_e;
            uint16_t tmpccer = TIM1->CCER;
            uint16_t tmpcr2 =  TIM1->CR2;
            uint16_t tmpccmrx = *ccmr;
            tmpccmrx &= (uint16_t)~ccmr_oc;
            tmpccmrx &= (uint16_t)~ccmr_cc;
            tmpccmrx |= (TIM_OCMODE_TIMING << mode_shift);
            tmpccer &= (uint16_t)~ccer_ccp;
            tmpccer |= (TIM_OCPOLARITY_HIGH << polarity_shift1);
            tmpccer |= (TIM_OUTPUTSTATE_ENABLE < state_shift);

