simondlevy/Hackflight/src/escs/dshot/stm32f405.h
            tmpccer &= (uint16_t)~ccer_ccnp;
            tmpccer |= (TIM_OCPOLARITY_HIGH << polarity_shift2);
            tmpcr2 &= (uint16_t)~cr2_ois;

            TIM1->CR2 = tmpcr2;
            *ccmr = tmpccmrx;
            *ccr = 0x00000000;
            TIM1->CCER = tmpccer;
        }

        static void rccInit(void)
        {
            RCC_APB2PeriphClockEnable(
                    RCC_APB2LPENR_TIM1LPEN_Msk   |
                    RCC_APB2LPENR_TIM8LPEN_Msk   |
                    RCC_APB2LPENR_USART1LPEN_Msk |
                    RCC_APB2LPENR_USART6LPEN_Msk |
                    RCC_APB2LPENR_ADC1LPEN_Msk   |
                    RCC_APB2LPENR_ADC2LPEN_Msk   |
                    RCC_APB2LPENR_ADC3LPEN_Msk   |
                    RCC_APB2LPENR_SDIOLPEN_Msk   |
                    RCC_APB2LPENR_SPI1LPEN_Msk   |
                    RCC_APB2LPENR_SYSCFGLPEN_Msk |
                    RCC_APB2LPENR_TIM9LPEN_Msk   |
                    RCC_APB2LPENR_TIM10LPEN_Msk  |
                    RCC_APB2LPENR_TIM11LPEN_Msk);
        }

        void timerChannelInit(port_t *bbPort)
        {
            const uint8_t channel = bbPort->channel;

            // Disable the TIM Counter
            TIM1->CR1 &= (uint16_t)~TIM_CR1_CEN;

            switch (channel) {
                case TIM_CHANNEL_1:
                    timOcInit( &TIM1->CCMR1, &TIM1->CCR1, TIM_CCER_CC1E,
                            TIM_CCMR1_OC1M, TIM_CCMR1_CC1S, TIM_CCER_CC1P,
                            TIM_CCER_CC1NP, TIM_CR2_OIS1, 0, 0, 0, 0);
                    break;
                case TIM_CHANNEL_2:
                    timOcInit( &TIM1->CCMR1, &TIM1->CCR2, TIM_CCER_CC2E,
                            TIM_CCMR1_OC2M, TIM_CCMR1_CC2S, TIM_CCER_CC2P,
                            TIM_CCER_CC2NP, TIM_CR2_OIS2, 8, 4, 4, 4);
                    break;
                case TIM_CHANNEL_3:
                    timOcInit( &TIM1->CCMR2, &TIM1->CCR3, TIM_CCER_CC3E,
                            TIM_CCMR2_OC3M, TIM_CCMR2_CC3S, TIM_CCER_CC3P,
                            TIM_CCER_CC3NP, TIM_CR2_OIS3, 0, 8, 8, 8);
                    break;
                case TIM_CHANNEL_4:
                    timOcInit( &TIM1->CCMR2, &TIM1->CCR4, TIM_CCER_CC4E,
                            TIM_CCMR2_OC4M, TIM_CCMR2_CC4S, TIM_CCER_CC4P,
                            TIM_CCER_CC4NP, TIM_CR2_OIS4, 8, 12, 12, 4);
                    break;
            }

            // Enable the TIM Counter
            TIM1->CR1 |= TIM_CR1_CEN;
        }

        bbPacer_t *findMotorPacer(void)
        {
            for (auto i=0; i<MAX_MOTORS; i++) {

                bbPacer_t *bbPacer = &m_pacers[i];

                if (bbPacer->tim == NULL) {
                    bbPacer->tim = TIM1;
                    return bbPacer;
                }

                if (bbPacer->tim == TIM1) {
                    return bbPacer;
                }
            }

            return NULL;
        }

    public:

        port_t *findMotorPort(int32_t portIndex)
        {
            for (auto i=0; i<m_usedMotorPorts; i++) {
                if (m_ports[i].portIndex == portIndex) {
                    if (portIndex == 2) {
                    }
                    return &m_ports[i];
                }
            }
            return NULL;
        }

        port_t *allocateMotorPort(int32_t portIndex)
        {
            if (m_usedMotorPorts >= MAX_MOTORS) {
                return NULL;
            }

            port_t *bbPort = &m_ports[m_usedMotorPorts];

            bbPort->portIndex = portIndex;

            ++m_usedMotorPorts;

            return bbPort;
        }

        dmaIdentifier_e dmaGetIdentifier(const dmaResource_t* channel)
        {
            for (uint8_t i=0; i<DMA_LAST_HANDLER; i++) {
                if (m_dmaDescriptors[i].ref == channel) {
                    return (dmaIdentifier_e)(i + 1);
                }
            }

            return DMA_NONE;
        }

        void dmaSetHandler(
                dmaIdentifier_e identifier,
                dmaCallbackHandlerFuncPtr callback,
                uint32_t priority,
                uint32_t userParam)
        {
            const int8_t index = identifier - 1;

            RCC_AHB1PeriphClockEnable(RCC_AHB1PERIPH_DMA2);
            m_dmaDescriptors[index].irqHandlerCallback = callback;
            m_dmaDescriptors[index].userParam = userParam;

            uint8_t irqChannel = m_dmaDescriptors[index].irqN;

            uint8_t tmppriority = 0x00, tmppre = 0x00, tmpsub = 0x0F;

            tmppriority = (0x700 - ((SCB->AIRCR) & (uint32_t)0x700))>> 0x08;
            tmppre = (0x4 - tmppriority);
            tmpsub = tmpsub >> tmppriority;

            tmppriority = nvic_priority_base(priority) << tmppre;
            tmppriority |= (uint8_t)(nvic_priority_sub(priority) & tmpsub);

            tmppriority = tmppriority << 0x04;

            NVIC->IP[irqChannel] = tmppriority;

            NVIC->ISER[irqChannel >> 0x05] =
                (uint32_t)0x01 << (irqChannel & (uint8_t)0x1F);
        }

    public:

        void * g_pacers[4];

        void setupDma(uint8_t motorIndex, port_t *bbPort)
        {
            RCC_AHB1PeriphClockEnable(RCC_AHB1PERIPH_DMA2);

            bbPort->dmaSource = timerDmaSource(bbPort->channel);

            bbPacer_t *bbPacer = findMotorPacer();

            g_pacers[motorIndex] = bbPacer;

            bbPacer->dmaSources |= bbPort->dmaSource;

            dmaSetHandler(
                    dmaGetIdentifier(bbPort->dmaResource),
                    dmaIrqHandler,
                    nvic_build_priority(2, 1),
                    (uint32_t)bbPort);

            dmaItConfig(bbPort);
        }

        const dmaChannelSpec_t *dmaGetChannelSpecByTimerValue(
                TIM_TypeDef *tim, uint8_t channel, int8_t dmaOpt)
        {
            if (dmaOpt < 0 || dmaOpt >= MAX_TIMER_DMA_OPTIONS) {
                return NULL;
            }

            for (uint8_t i=0 ; i<DMA_TIMER_MAPPING_COUNT; i++) {
                const dmaTimerMapping_t *timerMapping = &m_dmaTimerMapping[i];

                if (timerMapping->tim == tim && timerMapping->channel == channel &&
                        timerMapping->channelSpec[dmaOpt].ref) {

                    return &timerMapping->channelSpec[dmaOpt];
                }
            }

