simondlevy/Hackflight/src/escs/dshot/stm32f405.h
            return NULL;
        }

        bool motorConfig(uint8_t motorIndex)
        {
            IO_t io = m_motors[motorIndex].io;

            uint8_t output = m_motors[motorIndex].output;

            int32_t pinIndex  = MOTOR_PINS[motorIndex]; 
            int32_t portIndex = MOTOR_PORTS[motorIndex];

            port_t *bbPort = findMotorPort(portIndex);

            if (!bbPort) {

                // New port group

                bbPort = allocateMotorPort(portIndex);

                if (bbPort) {
                    static uint8_t options[4] = {1, 0, 1, 0};
                    const int8_t option = options[motorIndex];
                    const dmaChannelSpec_t *dmaChannelSpec =
                        dmaGetChannelSpecByTimerValue(TIM1, bbPort->channel, option); 
                    bbPort->dmaResource = dmaChannelSpec->ref;
                    bbPort->dmaChannel = dmaChannelSpec->channel;
                }

                bbPort->gpio =_IO_GPIO(io);

                bbPort->portOutputCount = BUF_LENGTH;
                bbPort->portOutputBuffer =
                    &m_outputBuffer[(bbPort - m_ports) * BUF_LENGTH];

                timebaseSetup(bbPort, m_protocol);

                bbPort->TIM_Prescaler = 0; // Feed raw timerClock
                bbPort->TIM_ClockDivision = TIM_CLOCKDIVISION_DIV1;
                bbPort->TIM_CounterMode = TIM_COUNTERMODE_UP;
                bbPort->TIM_Period = bbPort->outputARR;

                uint16_t tmpcr1 = TIM1->CR1;  

                // Select the Counter Mode
                tmpcr1 &= (uint16_t)(~(TIM_CR1_DIR | TIM_CR1_CMS));
                tmpcr1 |= (uint32_t)bbPort->TIM_CounterMode;

                // Set the clock division 
                tmpcr1 &=  (uint16_t)(~TIM_CR1_CKD);
                tmpcr1 |= (uint32_t)bbPort->TIM_ClockDivision;

                TIM1->CR1 = tmpcr1;

                // Set the Autoreload value 
                TIM1->ARR = bbPort->TIM_Period ;

                // Set the Prescaler value
                TIM1->PSC = bbPort->TIM_Prescaler;

                // Set the Repetition Counter value
                TIM1->RCR = bbPort->TIM_RepetitionCounter;

                // Generate an update event to reload the Prescaler 
                // and the repetition counter(only for TIM1 and TIM8) value immediately
                TIM1->EGR = 0x0001;          

                TIM1->CR1 |= TIM_CR1_ARPE;

                timerChannelInit(bbPort);

                setupDma(motorIndex, bbPort);

                dmaPreconfigure(bbPort);

                dmaItConfig(bbPort);
            }

            motor_t * bbMotor = &m_motors[motorIndex];

            bbMotor->pinIndex = pinIndex;
            bbMotor->io = io;
            bbMotor->output = output;
            bbMotor->bbPort = bbPort;

            _IOInit(io, motorIndex+1);

            // Setup GPIO_MODER and GPIO_ODR register manipulation values

            bbPort->gpioModeMask |= (GPIO_MODER_MODER0 << (pinIndex * 2));
            bbPort->gpioModeInput |= (GPIO_Mode_IN << (pinIndex * 2));
            bbPort->gpioModeOutput |= (GPIO_Mode_OUT << (pinIndex * 2));

            bbPort->gpioIdleBSRR |= (1 << (pinIndex + 16));  // BR (higher half)

            _IO_GPIO(io)->BSRR |= (((uint32_t)(_IO_Pin(io))) << 16);

            _IOConfigGPIO(motorIndex, io,
                    io_config(GPIO_Mode_OUT, GPIO_FAST_SPEED, GPIO_OTYPE_PP, m_puPdMode));

            outputDataInit(bbPort->portOutputBuffer, (1 << pinIndex)); 

            // Output idle level before switching to output
            // Use BSRR register for this
            // Normal: Use BR (higher half)
            // Inverted: Use BS (lower half)

            bbPort->gpio->BSRR = bbPort->gpioIdleBSRR;

            // Set GPIO to output
            ATOMIC_BLOCK(nvic_build_priority(1, 1)) {
                MODIFY_REG(bbPort->gpio->MODER,
                        bbPort->gpioModeMask,
                        bbPort->gpioModeOutput);
            }

            // Reinitialize port group DMA for output

            dmaResource_t *dmaResource = bbPort->dmaResource;
            loadDmaRegs(dmaResource, &bbPort->dmaRegOutput);

            // Reinitialize pacer timer for output

            TIM1->ARR = bbPort->outputARR;

            bbMotor->configured = true;

            return true;
        }

        void initChannel(
                const uint8_t timerId,
                TIM_TypeDef * tim,
                const uint8_t channel,
                const uint8_t specId,
                const uint32_t d,
                const uint32_t s,
                const uint32_t c)
        {
            m_dmaTimerMapping[timerId].tim = tim;
            m_dmaTimerMapping[timerId].channel = channel;

            dmaChannelSpec_t * spec = &m_dmaTimerMapping[timerId].channelSpec[specId];
            spec->code = (d << 12) |( s << 8) | (c << 0);
            spec->ref = (dmaResource_t *)m_streams[s];
            spec->channel = c << 25;
        }

        void initTimerMapping(void)
        {
            initChannel(0, TIM1, TIM_CHANNEL_1, 1, 2, 1, 6); 
            initChannel(1, TIM1, TIM_CHANNEL_2, 1, 2, 2, 6); 
            initChannel(2, TIM2, TIM_CHANNEL_1, 0, 1, 5, 3); 
            initChannel(3, TIM2, TIM_CHANNEL_3, 0, 1, 1, 3); 
            initChannel(4, TIM5, TIM_CHANNEL_2, 0, 1, 4, 6); 
            initChannel(5, TIM5, TIM_CHANNEL_4, 0, 1, 1, 6); 
        }

        void initTimerDefinition(uint8_t id, TIM_TypeDef * tim, uint32_t apb, uint32_t en)
        {
            m_timerDefinitions[id].TIMx = tim;
            m_timerDefinitions[id].rcc = rcc_encode(apb, en);
        }

        void initTimerDefinitions(void)
        {
            initTimerDefinition(0, TIM1, RCC_APB2, RCC_APB2ENR_TIM1EN);
            initTimerDefinition(1, TIM2, RCC_APB1, RCC_APB1ENR_TIM2EN);
            initTimerDefinition(2, TIM5, RCC_APB1, RCC_APB1ENR_TIM5EN);
        }

        void initTimer1Hardware(void)
        {
            m_timer1channels[0] = TIM_CHANNEL_1;
            m_timer1channels[1] = TIM_CHANNEL_2;
            m_timer1channels[2] = TIM_CHANNEL_3;
            m_timer1channels[3] = TIM_CHANNEL_4;
        }

        void defineDma2Channel(
                uint8_t stream,
                DMA_Stream_TypeDef * ref,
                uint8_t flagsShift,
                IRQn_Type irqN)
        {
            dmaChannelDescriptor_t * desc = &m_dmaDescriptors[stream+8];

            desc->dma = DMA2;
            desc->ref = (dmaResource_t *)ref;
            desc->stream = stream;
            desc->flagsShift = flagsShift;
            desc->irqN = irqN;
        }

        void dmaInit(void)
        {
            defineDma2Channel(0, DMA2_Stream0, 0,  DMA2_Stream0_IRQn); 
            defineDma2Channel(1, DMA2_Stream1, 6,  DMA2_Stream1_IRQn); 
            defineDma2Channel(2, DMA2_Stream2, 16, DMA2_Stream2_IRQn); 
            defineDma2Channel(3, DMA2_Stream3, 22, DMA2_Stream3_IRQn); 
            defineDma2Channel(4, DMA2_Stream4, 32, DMA2_Stream4_IRQn); 
            defineDma2Channel(5, DMA2_Stream5, 38, DMA2_Stream5_IRQn); 
            defineDma2Channel(6, DMA2_Stream6, 48, DMA2_Stream6_IRQn); 
            defineDma2Channel(7, DMA2_Stream7, 54, DMA2_Stream7_IRQn); 
        }

        uint8_t timerRCC(TIM_TypeDef *tim)
        {
            for (int32_t i = 0; i < HARDWARE_TIMER_DEFINITION_COUNT; i++) {
                if (m_timerDefinitions[i].TIMx == tim) {
                    return m_timerDefinitions[i].rcc;
                }
            }
            return 0;
        }

        void timerInit(void)
        {
            RCC_ClockEnable(timerRCC(TIM5));
            RCC_ClockEnable(timerRCC(TIM2));
            RCC_ClockEnable(timerRCC(TIM2));
            RCC_ClockEnable(timerRCC(TIM5));
        }

        void ioInit(void)
        {
            ioRec_t *ioRec = m_ioRecs;

            for (uint8_t port=0; port<4; port++) {
                for (uint8_t pin=0; pin < 16; pin++) {
                    ioRec->gpio = (GPIO_TypeDef *)(GPIOA_BASE + (port << 10));
                    ioRec->pin = 1 << pin;
                    ioRec++;
                }
            }
        }

