simondlevy/Hackflight/src/escs/dshot/stm32f405.h
    protected: // DshotEsc method overrides =============================================

        virtual void deviceInit(void) override
        {
            rccInit();

            ioInit();

            timerInit();

            initTimerMapping();

            initTimerDefinitions();

            initTimer1Hardware();

            dmaInit();

            memset(m_outputBuffer, 0, sizeof(m_outputBuffer));

            uint8_t motorIndex = 0;

            for (auto pin : *m_pins) {

                const IO_t io = _IOGetByTag(pin);

                m_puPdMode = GPIO_PUPD_UP;

                int32_t pinIndex = MOTOR_PINS[motorIndex];

                m_motors[motorIndex].pinIndex = pinIndex;
                m_motors[motorIndex].io = io;
                m_motors[motorIndex].output = 0;
                m_motors[motorIndex].iocfg =
                    io_config(GPIO_MODE_OUT, GPIO_FAST_SPEED, GPIO_OTYPE_PP, m_puPdMode);

                _IOInit(io, motorIndex+1);
                _IOConfigGPIO(motorIndex, io, m_motors[motorIndex].iocfg);

                _IO_GPIO(io)->BSRR |= (uint32_t)_IO_Pin(io);

                motorIndex++;
            }

            m_ports[0].channel = m_timer1channels[0];
            m_ports[1].channel = m_timer1channels[1];
            m_ports[2].channel = m_timer1channels[2];
            m_ports[3].channel = m_timer1channels[3];

            for (auto motorIndex=0; motorIndex<MAX_SUPPORTED_MOTORS && motorIndex <
                    m_motorCount; motorIndex++) {

                if (!motorConfig(motorIndex)) {
                    return;
                }

                m_motors[motorIndex].enabled = true;
            }

            for (auto i=0; i<m_motorCount; i++) {
                if (m_motors[i].configured) {
                    _IOConfigGPIO(i, m_motors[i].io, m_motors[i].iocfg);
                }
            }
        }        

        virtual void updateComplete(void) override
        {
            for (auto i=0; i<m_usedMotorPorts; i++) {
                port_t *bbPort = &m_ports[i];

                dmaCmd(bbPort, ENABLE);
            }

            for (auto i=0; i<1; i++) {
                bbPacer_t *bbPacer = &m_pacers[i];
                timDmaCmd(bbPacer->dmaSources, ENABLE);
            }
        }

        virtual void updateStart(void) override
        {
            for (auto i=0; i<m_usedMotorPorts; i++) {
                dmaCmd(&m_ports[i], DISABLE);
                outputDataClear(m_ports[i].portOutputBuffer);
            }
        }

        virtual void write(uint8_t index, float value) override
        {
            uint16_t ivalue = (uint16_t)value;

            motor_t *const bbmotor = &m_motors[index];

            if (!bbmotor->configured) {
                return;
            }

            // If there is a command ready to go overwrite the value and send
            // that instead
            if (commandIsProcessing()) {
                ivalue = commandGetCurrent(index);
            }

            bbmotor->value = ivalue;

            uint16_t packet = prepareDshotPacket(bbmotor->value);

            port_t *bbPort = bbmotor->bbPort;

            outputDataSet(bbPort->portOutputBuffer, bbmotor->pinIndex, packet); 
        }

    public:

        Stm32F405DshotEsc(vector<uint8_t> & pins, protocol_t protocol=DSHOT600)
            : DshotEsc(pins, protocol)
        {
        }

        void handleDmaIrq(const uint8_t id)
        {
            const uint8_t index = id - 1;

            dmaCallbackHandlerFuncPtr handler =
                m_dmaDescriptors[index].irqHandlerCallback;

            if (handler) {
                handler(&m_dmaDescriptors[index]);
            }
        }

}; // class Stm32F4DshotEsc
